constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}

momentumSource
{
    type            meanVelocityForce;

    active          yes;

    selectionMode   cellZone;
    cellZone        windZone;

    fields          (U);

    Ubar            (5 0 0);

    relaxation      0.2;

    timeStart       0;

    duration        10000;
}