system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

scale 1;

vertices
(
    // Back plane: y = -0.02
    (0.0  -0.02  0.0)     // 0
    (5.4  -0.02  0.0)     // 1
    (5.5  -0.02  0.0)     // 2
    (6.0  -0.02  0.0)     // 3

    (0.0  -0.02  0.65)    // 4
    (5.4  -0.02  0.65)    // 5
    (5.5  -0.02  0.65)    // 6
    (6.0  -0.02  0.65)    // 7

    (0.0  -0.02  1.0)     // 8
    (5.4  -0.02  1.0)     // 9
    (5.5  -0.02  1.0)     // 10
    (6.0  -0.02  1.0)     // 11


    // Front plane: y = 0
    (0.0   0.0   0.0)     // 12
    (5.4   0.0   0.0)     // 13
    (5.5   0.0   0.0)     // 14
    (6.0   0.0   0.0)     // 15

    (0.0   0.0   0.65)    // 16
    (5.4   0.0   0.65)    // 17
    (5.5   0.0   0.65)    // 18
    (6.0   0.0   0.65)    // 19

    (0.0   0.0   1.0)     // 20
    (5.4   0.0   1.0)     // 21
    (5.5   0.0   1.0)     // 22
    (6.0   0.0   1.0)     // 23
);

blocks
(
    // Left lower region
    hex (0 1 13 12 4 5 17 16)      (110 1 18) simpleGrading (1 1 1)

    // Left upper region
    hex (4 5 17 16 8 9 21 20)      (110 1 12) simpleGrading (1 1 1)

    // Region above rectangular wall
    hex (5 6 18 17 9 10 22 21)     (18 1 12) simpleGrading (1 1 1)

    // Right lower region
    hex (2 3 15 14 6 7 19 18)      (25 1 18) simpleGrading (1 1 1)

    // Right upper region
    hex (6 7 19 18 10 11 23 22)    (25 1 12) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 12 16 4)
        (4 16 20 8)
    )

    patch outlet
    (
        (3 15 19 7)
        (7 19 23 11)
    )

    wall bottom
    (
        (0 1 13 12)
        (2 3 15 14)
    )

    wall caisson
    (
        // Left vertical wall of obstacle
        (1 13 17 5)

        // Top wall of obstacle
        (5 6 18 17)

        // Right vertical wall of obstacle
        (2 14 18 6)
    )

    patch atmosphere
    (
        (8 9 21 20)
        (9 10 22 21)
        (10 11 23 22)
    )

    wall frontAndBack
    (
        // Back faces
        (0 1 5 4)
        (4 5 9 8)
        (5 6 10 9)
        (2 3 7 6)
        (6 7 11 10)

        // Front faces
        (12 13 17 16)
        (16 17 21 20)
        (17 18 22 21)
        (14 15 19 18)
        (18 19 23 22)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //